Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/employment_permits/green_card_permits.html.txt.tmx
Source language: en
Languages: ga

source: Critical Skills Employment Permit
ga: Cead Fostaíochta Scileanna Ríthábhachtacha

source: • Rates • How to apply
ga: • Cónas a dhéanfaidh mé iarratas

source: If you are a national from a country which is not in the European Economic Area (EEA) or Switzerland, in general you will need an employment permit to work in Ireland
ga: Más náisiúnach thú ó thír nach bhfuil sa Limistéar Eorpach Eacnamaíochta (LEE) nó san Eilvéis, teastóidh cead fostaíochta uait, go ginearálta, chun oibriú in Éirinn

source: Under the Employment Permits Acts 2003–2014 there are 9 types of employment permit including a Critical Skills Employment Permit (formerly Green Card permit), a General Employment Permit (formerly work permit) and a Dependant/Partner/Spouse Employment Permit
ga: Faoi na hAchtanna um Cheadanna Fostaíochta, 2003-2014 tá 9 saghas de chead fostaíochta ann, lena n-áirítear Cead Fostaíochta Scileanna Ríthábhachtacha (cead an Chárta Ghlais roimhe seo), Cead Fostaíochta Ginearálta (cead oibre roimhe seo) agus Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: Since 1 October 2014, the Employment Permits (Amendment) Act 2014 has changed the current employment permits system through the provision of 9 different types of employment permit and changes to the criteria for issuing employment permits
ga: Ón 1 Deireadh Fómhair 2014 ar aghaidh, d’athraigh an tAcht um Cheadanna Fostaíochta, (Leasú), 2014 an córas reatha ceadanna fostaíochta trí 9 saghas éagsúla de chead fostaíochta a sholáthar agus athruithe a dhéanamh ar na critéir chun ceadanna fostaíochta a eisiúint

source: The Act also provides that a foreign national without an employment permit, who took all reasonable steps to obtain one, may be allowed to take civil action against the employer for compensation for work done or services rendered
ga: Anuas air sin, forálann an tAcht gur féidir le náisiúnach iasachta nach bhfuil cead fostaíochta aige/aici, a rinne gach beart réasúnta chun ceann a fháil, dul i mbun caingean shibhialta i leith an fhostóra chun cúiteamh a fháil as aon obair a rinneadh nó aon seirbhísí a soláthraíodh

source: Critical Skills Employment Permits are issued by the Department of Jobs, Enterprise and Innovation
ga: Eisíonn an Roinn Post, Fiontar agus Nuálaíochta Ceadanna Fostaíochta Scileanna Ríthábhachtacha

source: Either the employer or the employee can apply for the permit which must be based on an offer of employment – see 'How to apply' below
ga: Féadfaidh an fostóir nó an fostaí iarratas a dhéanamh ar an gcead, agus ní mór dó a bheith bunaithe ar thairiscint fostaíochta – féach ‘Conas iarratas a dhéanamh thíos’

source: The permit is granted to the employee and includes a statement of the employee's rights and entitlements
ga: Deonaítear an cead don fhostaí agus áirítear leis ráiteas ar chearta agus teidlíochtaí an fhostaí

source: An employee working on an employment permit is protected by employment legislation in exactly the same way as other employees
ga: Cosnaíonn an reachtaíocht fostaíochta fostaí atá ag oibriú agus cead fostaíochta aige/aici, ar an mbealach céanna a chosnaíonn an reachtaíocht fostaithe eile

source: There are 2 categories of eligible occupations for a Critical Skills Employment Permit as follows:
ga: Tá 2 chatagóir de ghairmeacha incháilithe ann le haghaidh Cead Fostaíochta Scileanna Ríthábhachtacha, agus is seo a leanas iad:

source: (1) Jobs with annual salaries of €60,000 or more – all occupations (other than certain ineligible job categories and those which are contrary to the public interest)
ga: (1) Poist ag a bhfuil tuarastail €60,000 nó de bhreis air sin – gach gairm (seachas catagóirí áirithe incháilithe poist agus iad siúd a thagann salach ar leas an phobail)

source: (2) Jobs with annual salaries of €30,000 or more – the occupation must be on the Highly Skilled Occupations List
ga: (2) Poist ag a bhfuil tuarastail €30,000 nó de bhreis air sin – ní mór don ghairm bheith le sonrú ar Liosta na nGairmeacha Ardoilte

source: Since 10 April 2013, non-EEA nationals with a stamp 1, 1A, 2, 2A or 3 residence permission, who have been offered a job in an occupation on the Highly Skilled Occupations List, may apply for an employment permit
ga: Ón 10 Aibreán 2013, náisiúnaigh neamh-LEE a bhfuil stampa cead cónaithe 1, 1A, 2, 2A nó 3 acu a ndearnadh post a thairiscint dóibh i ngairm a shonraítear ar Liosta na nGairmeacha Ardoilte, iarratas a dhéanamh ar chead fostaíochta

source: You must have a job offer from a company or employer who is registered with Revenue, trading in Ireland and registered with the Companies Registration Office
ga: Ní mór go mbeidh tairiscint poist faighte acu ó chuideachta nó ó fhostóir atá cláraithe leis na Coimisinéirí Ioncaim, a dhéanann trádáil in Éirinn agus atá cláraithe leis an Oifig um Chlárú Cuideachtaí

source: You must be directly employed and paid by your employer in Ireland
ga: Ní mór go mbíonn tú fostaithe agus íoctha go díreach ag d’fhostóir in Éirinn

source: Job offers from recruitment agencies and other intermediaries are not acceptable under the scheme
ga: Ní ghlactar le tairiscintí poist ó ghníomhaireachtaí earcaíochta agus ó idirghabhálaithe eile faoin scéim

source: The job offer must be for 2 years or more
ga: Ní mór go bhfuil post a mhairfidh 2 bhliain nó níos faide i gceist leis an tairiscint poist

source: Labour market needs test
ga: Tástáil riachtanas an mhargaidh shaothair

source: A labour market needs test is not required, that is the employer does not need to advertise the job with the Department of Social Protection employment services/EURES or in newspapers
ga: Ní theastaíonn tástáil riachtanas an mhargaidh shaothair, is é sin, ní gá don fhostóir an post a fhógairt le seirbhísí fostaíochta na Roinne Coimirce Sóisialaí/EURES nó i nuachtáin

source: However, an employment permit will not be granted to companies if the granting of the permit would mean that more than 50% of the employees would be non-EEA nationals
ga: Ní dheonófar cead fostaíochta, áfach, do chuideachtaí dá mbeadh breis agus 50% de na fostaithe ina náisiúnaigh neamh-LEE mar gheall ar an gcead a dheonú

source: This requirement may be waived in the case of start-up companies which are supported by Enterprise Ireland or IDA Ireland
ga: Féadtar an ceanglas seo a tharscaoileadh i gcás cuideachtaí nuathionscanta lena dtacaíonn Fiontar Éireann nó GFT Éireann

source: You must have the relevant qualifications, skills and experience required for the job
ga: Ní mór go bhfuil na cáilíochtaí, scileanna agus taithí a theastaíonn don phost agat

source: For jobs in the €30,000 or more salary range you must have a degree qualification or higher
ga: I gcás post sa réimse tuarastail €30,000 nó níos mó, ní mór go mbeidh cáilíocht chéime nó níos airde agat

source: For jobs with an annual salary of €60,000 or over, you must have a degree or equivalent experience
ga: I gcás post ag a bhfuil tuarastal bliantúil €60,000 nó os a chionn sin, ní mór go mbeidh céim nó a chomhionann de thaithí agat

source: Registration and permission to remain
ga: Clárúchán agus cead chun fanacht

source: If you are not an EEA or Swiss national you must register with your local immigration officer in the area where you intend to live when you arrive in the State
ga: Mura náisiúnach LEE nó Eilvéiseach thú, ní mór duit clárú le d’oifigeach áitiúil inimirce sa cheantar ina bhfuil sé ar intinn agat cónaí nuair a thagann tú chun an Stáit

source: In the Dublin area, the registration is done at the Burgh Quay Registration Office
ga: I gceantar Bhaile Átha Cliath, déantar an clárúchán ag Oifig Chlárúcháin Cé an Bhúrcaigh

source: Since 15 September 2016, you must book an appointment online to visit it
ga: Ó 15 Meán Fómhair 2016, caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: If you are living outside Dublin, you should register at your regional registration office or your local Garda District Headquarters
ga: Má tá cónaí ort lasmuigh de Bhaile Átha Cliath, ba cheart duit clárú ag d'oifig chlárúcháin régiúnach nó ag Ceanncheathrú áitiúil Cheantar an Gharda Síochána

source: This is in order to obtain permission to remain and to ensure you have the correct immigration status, that is, as an employee
ga: Is amhlaidh atá an scéal chun cead a fháil chun fanacht agus lena chinntiú go bhfuil an stádas ceart inimirce agat, is é sin, mar fhostaí

source: You will be given a Certificate of Registration which is also known as a GNIB card
ga: Tabharfar Deimhniú Clárúcháin duit, ar a dtugtar cárta an BNIGS, chomh maith

source: Expiry of Critical Skills Employment Permit
ga: Éag Cead Fostaíochta Scileanna Ríthábhachtacha

source: The Critical Skills (and Green Card) Employment Permit is issued for 2 years and you are not required to renew it
ga: Eisítear an Cead Fostaíochta Scileanna Ríthábhachtacha (agus an Cárta Glas) ar feadh 2 bhliain agus ní gá duit é a athnuachan

source: Instead you apply to your local immigration officer for a Stamp 4 permission to live and work in Ireland without an employment permit
ga: Ina ionad sin, déanann tú iarratas ar d’oifigeach áitiúil inimirce ar chead Stampa 4 chun cónaí agus oibriú in Éirinn gan cead fostaíochta

source: From 1 April 2015, there is a new application procedure for this Stamp 4 permission
ga: Ón 1 Aibreán 2015 ar aghaidh, tá nós imeachta iarratais nua don chead Stampa 4 seo

source: First, you must apply on this request form for a support letter from the Department of Jobs, Enterprise and Innovation confirming your current employment
ga: Ar an gcéad dul síos, ní mór duit iarratas a dhéanamh ar an bhfoirm iarratais (pdf) seo ar litir thacaíocht ón Roinn Post, Fiontar agus Fostaíochta a dheimhníonn go bhfuil tú fostaithe faoi láthair

source: You can find details of the new procedure and the documentation required on djei.ie
ga: Féadfaidh tú teacht ar shonraí faoin nós imeachta nua agus an cháipéisíocht a theastaíonn ar djei.ie

source: You then register with your local immigration officer – see above
ga: Ansin cláraíonn tú le d’oifigeach áitiúil inimirce – féach thuas

source: You must have the following documents with you:
ga: Ní mór duit na cáipéisí a leanas a bheith agat:

source: • Certificate of Registration (GNIB card)
ga: • Deimhniú Clárúcháin (cárta BNIGS)

source: • Your Critical Skills or Green Card Employment Permit
ga: • Do Chead Fostaíochta Scileanna Ríthábhachtacha nó do Chárta Glas

source: • Letter from the Department of Jobs, Enterprise and Innovation confirming your continuing employment
ga: • Litir ón Roinn Post, Fiontar agus Fostaíochta a dheimhníonn go bhfuil tú fostaithe faoi láthair

source: If you are granted a Stamp 4 permission, it will be for 2 years and will be renewable provided you continue to satisfy the criteria for it
ga: Má dheonaítear cead Stampa 4 duit, ar feadh tréimhse 2 bhliain a bheidh sé agus déanfar é a athnuachan a fhad agus a shásaíonn tú na critéir don chead

source: When you have been legally resident for 5 years, you may apply for long-term residency
ga: Nuair a bhíonn cónaí dleathach ort ar feadh 5 bliana, féadfaidh tú iarratas a dhéanamh ar chónaitheacht fhadtéarmach

source: If you are not eligible for a Stamp 4, you may be issued with a Stamp 1 and you will continue to need an employment permit to work in Ireland
ga: Mura bhfuil tú incháilithe do Stampa 4, féadtar Stampa 1 a eisiúint duit agus leanfaidh cead fostaíochta a bheith ag teastáil uait chun oibriú in Éirinn

source: If you have a passport from a country whose passport holders require a visa to enter Ireland you must apply for an entry visa online
ga: Má tá pas agat ó thír ina dteastaíonn víosa ó shealbhóirí pas chun Éire a iontráil ní mór duit iarratas a dhéanamh ar víosa iontrála ar líne

source: You may apply to have your spouse, partner and/or minor dependent children join you once you have obtained your Critical Skills Employment Permit
ga: Ní mór duit iarratas a dhéanamh go dtiocfaidh do chéile, páirtnéir agus/nó mionchleithiúnaí i dteannta leat a luaithe a fuair tú do Chead Fostaíochta Scileanna Ríthábhachtacha

source: There is information about family reunification on the INIS website
ga: Tá faisnéis faoi athaontú teaghlaigh ar láithreán gréasáin SEIÉ

source: Spouses, partners and dependants of employees on employment permits may be able to obtain Dependant/Partner/Spouse Employment Permits provided they are legally resident here
ga: Ina theannta sin, d’fhéadfadh go mbeadh céilí, páirtnéirí agus cleithiúnaithe fostaithe a bhfuil ceadanna fostaíochta acu in ann Ceadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile a fháil, a fhad agus a bhfuil cónaí dleathach orthu anseo

source: If this is your first employment permit in Ireland then you are expected to remain with your employer for 12 months (unless there are exceptional circumstances)
ga: Más é seo do chéad chead fostaíochta in Éirinn, bítear ag súil leis go bhfanfaidh tú le d’fhostóir ar feadh 12 mhí (mura bhfuil cúinsí eisceachtúla i gceist)

source: After that you may change employer provided that a new application for a Critical Skills Employment Permit is made
ga: Ina dhiaidh sin, féadfaidh tú fostóir a athrú, a fhad agus go ndéantar iarratas nua ar Chead Fostaíochta Scileanna Ríthábhachtacha

source: If you lose your job through redundancy you should notify the Department of Jobs, Enterprise and Innovation using the redundancy notification form within 28 days of dismissal
ga: Má chailleann tú do phost trí iomarcaíocht, ba cheart duit an Roinn Post, Fiontar agus Nuálaíochta a chur ar an eolas trí foirm um fhógra iomarcaíochta a úsáid laistigh de 28 lá tar éis dífhostú

source: The Department will allow you a period of 6 months to find another job
ga: Tabharfaidh an Roinn tréimhse 6 mhí duit chun post eile a aimsiú

source: When you find another job you can apply for a new Critical Skills Employment Permit even if the job is now in one of the ineligible categories
ga: Nuair a aimsíonn tú post eile, féadfaidh tú iarratas a dhéanamh ar Chead Fostaíochta Scileanna Ríthábhachtacha, fiú má tá an post anois i gceann de na catagóirí neamhcháilithe

source: You should contact your local immigration officer to confirm your immigration status - see 'Registration' above
ga: Ba cheart duit teagmháil a dhéanamh le d’oifigeach áitiúil inimirce le do stádas inimirce a dheimhniú – féach ‘Clárúchán’ thuas

source: If you have more than 6 months before your immigration permission expires, you can reside in Ireland under your stamp 1 permission for 6 months
ga: Mura n-éagfaidh to chead inimirce go ceann 6 mhí, ar a laghad, féadfaidh tú cónaí in Éirinn faoin gcead stampa 1 a fuair tú, ar feadh 6 mhí

source: If you have less than 6 months' immigration permission you can have your immigration permission extended to 6 months which means you will have to pay for a new Certificate of Registration - see 'Rates' below
ga: Má éagfaidh do chead inimirce laistigh de 6 mhí, féadfaidh tú a iarraidh go sínfear do chead inimirce go dtí 6 mhí, a chiallaíonn go mbeidh ort íoc as Deimhniú Clárúcháin – féach ‘Rátaí’ thíos

source: If you have not found a new job after 6 months you will be expected to leave Ireland
ga: Murar aimsigh tú post nua tar éis 6 mhí, beifear ag súil leis go bhfágfaidh tú Éire

source: If you then get an offer of employment in Ireland you may apply for a new employment permit
ga: Má thugtar tairiscint fostaíochta duit in Éirinn, ansin, féadfaidh tú iarratas a dhéanamh ar chead nua fostaíochta

source: Further details about the new provisions for non-EEA nationals who are made redundant are on the INIS website
ga: Tá breis sonraí faoi na forálacha nua le haghaidh náisiúnaigh neamh-LEE a ndéantar iomarcach iad ar láithreán gréasáin SEIÉ

source: The fee for a Critical Skills Employment Permit must be paid by the applicant
ga: Ní mór don iarratasóir íoc as an táille atá ar Chead Fostaíochta Scileanna Ríthábhachtacha

source: Payments from businesses are made by electronic fund transfer (EFT)
ga: Déantar íocaíochtaí ó ghnólachtaí trí ríomhaistriú airgid (EFT)

source: │Permit │Fee │Duration │
ga: │Cead │Táille │Fad │

source: │New │€1,000 │Up to 2 years │
ga: │Nua │€1,000 │A fhad le 2 bhliain │

source: If an application is refused or withdrawn, 90% of the fee will be refunded to the applicant
ga: Má dhiúltaítear nó má aistarraingítear iarratas, aisíocfar 90% den táille leis an iarratasóir

source: The fee for the Certificate of Registration is €300
ga: Is í an táille atá ar Dheimhniú Clárúcháin ná €300

source: Applications for a Critical Skills Employment Permit should be made to the Employment Permits Section of the Department of Jobs, Enterprise and Innovation
ga: Ba cheart iarratais ar Chead Fostaíochta Scileanna Ríthábhachtacha a dhéanamh le Rannóg Ceadanna Fostaíochta na Roinne Post, Fiontar agus Nuálaíochta., féadfaidh an fostóir nó an fostaí iarratas a dhéanamh

source: Either the employer or the employee can apply. Since 5 September 2016, you apply online with the required documentation, using the Employment Permits Online System (EPOS)
ga: Ó 5 Meán Fómhair 2016, féadtar iarratais a dhéanamh ar líne leis an cháipéisíocht tacaíochta a theastaíonn agus leas a bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: Processing and reviews: You can check the status of your application through the online status enquiry facility
ga: Próiseáil agus athbhreithnithe: Féadfaidh tú stádas d’iarratas tríd an tsaoráid fhiosrúcháin faoi stádas ar líne a sheiceáil

source: The application processing times are on the Department’s website
ga: Tá na hamanna próiseála iarratais ar shuíomh gréasáin na Roinne

source: The official processing your application will either grant it or refuse it for specific reasons
ga: Déanfaidh próiseáil oifigiúil d’iarratais é a dheonú nó a dhiúltú ar údair shonracha

source: If your application is refused you may appeal within 28 days, using the form to submit a decision for review
ga: Má dhiúltaítear d’iarratas, féadfaidh tú achomharc a dhéanamh laistigh de 28 lá, trí leas a bhaint as an bhfoirm chun cinneadh a sheoladh isteach a bhfuil athbhreithniú le déanamh air

source: There is further information about the Critical Skills Employment Permit on the Department of Jobs, Enterprise and Innovation's website
ga: Tá breis faisnéise ar fáil faoin gCead Fostaíochta Scileanna Ríthábhachtacha ar láithreán gréasáin na Roinne Post, Fiontar agus Nuálaíochta
